app/controllers/admin_controller.rb

  def index

    @pagesize = 6

    page = (params[:page] || 1)

    offset = ((page.to_i - 1) * @pagesize)

    offset = 0 if offset < 0

    @apps = Application.all.offset(offset).limit(@pagesize)
---
SELECT  `applications`.* FROM `applications` LIMIT 6 OFFSET 0
SELECT COUNT(*) FROM `applications`

  def ajax_apps_list

    pagesize = 6

    page = (params[:page] || 1)

    offset = ((page.to_i - 1) * pagesize)

    offset = 0 if offset < 0

    apps = Application.all.offset(offset).limit(pagesize)
---
SELECT  `applications`.* FROM `applications` LIMIT 6 OFFSET 0

  def ajax_delete_icon

    if File.exists?("#{Rails.root}/public/data/#{params["values"]["icon"].strip}")

      File.delete("#{Rails.root}/public/data/#{params["values"]["icon"].strip}")

    end

    Application.find(params["values"]["id"]).update_attributes(:icon_link => nil) # rescue nil
---
SELECT  `applications`.* FROM `applications` WHERE `applications`.`id` = ? LIMIT 1  [["id", 1]]
UPDATE `applications` SET `icon_link` = ?, `updated_at` = ? WHERE `applications`.`id` = ?  [["icon_link", nil], ["updated_at", "2018-03-21 12:18:06"], ["id", 1]]

  def void

    app = Application.find(params["id"]) rescue nil


    if File.exists?("#{Rails.root}/public/data/#{app["icon_link"].strip rescue nil}")

      File.delete("#{Rails.root}/public/data/#{app["icon_link"].strip rescue nil}") rescue nil

    end

    app.destroy
---
SELECT  `applications`.* FROM `applications` WHERE `applications`.`id` = ? LIMIT 1  [["id", 1]]
DELETE FROM `applications` WHERE `applications`.`id` = ?  [["id", 1]]

  def update_app

    if !params["values"].blank?

      if params["values"]["id"].strip.downcase == "new"

        app = Application.create(:application_name => params["values"]["name"], :url => params["values"]["url"]) rescue nil

      else

        app = Application.find(params["values"]["id"]).update_attributes(:application_name => params["values"]["name"], :url => params["values"]["url"]) rescue nil
---
SELECT  `applications`.* FROM `applications` WHERE `applications`.`id` = ? LIMIT 1  [["id", 2]]
UPDATE `applications` SET `url` = ?, `updated_at` = ? WHERE `applications`.`id` = ?  [["url", "http://localhost:3000"], ["updated_at", "2018-03-21 13:22:26"], ["id", 2]]

  def dologin

    user = User.find_by_username(params[:username]) rescue nil
---
SELECT  `users`.* FROM `users` WHERE `users`.`username` = ? LIMIT 1  [["username", "admin"]]