app/controllers/home_controller.rb

SELECT  `applications`.* FROM `applications` LIMIT 11 OFFSET 0
---
  def ajax_links

    page = params[:page].to_i rescue 1

    page = 1 if params.nil? or page < 1

    if page == 1
      pagesize = 11

      startpos = 0
    else
      pagesize = 10

      startpos = 11 + ((page - 2) * 10)
    end

    apps = {}

    Application.all.offset(startpos).limit(pagesize).each do |app|

INSERT INTO `frequencies` (`application`, `client`, `created_at`, `updated_at`) VALUES (?, ?, ?, ?)  [["application", 7], ["client", "127.0.0.1"], ["created_at", "2018-03-20 16:51:22"], ["updated_at", "2018-03-20 16:51:22"]]
---
  def log_app

    Frequency.create(:application => params["id"], :client => request.remote_ip) rescue nil